tutorials/pehills_foam/pre_processing/baseline_foam/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00235;

boundaryField
{
    "(bottomWall|topWall)"
    {
      type            nutkWallFunction;
      value           uniform 0.0;
    }
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}

// Coppied from nut

// ************************************************************************* //
